# a = 5               # переменная типа int
# pi = 3.14           # переменная типа float
# s = "Hello, world"  # переменная типа string пишется всегда в кавычках
# t = True            # переменная типа bool
# print (a)
# print (pi)
# print (s)
# print (t)
# print ("передал текст")
# a = 2
# b = a + 2
# a = b * 4
# print (a)
# a = 5
# b = 2
# # сложение
# c = a + b
# # вычитание
# d = a - b
# # деление
# e = a / b
# # умножение
# f = a * b
# # остаток от деления
# z = a % b
# # деление нацело
# x = a // b
# # возведение в степень
# v = a ** b
# print (c, 'сложение')
# print (d, 'вычитание')
# print(e, 'деление')
# print(f, 'умножение')
# print(z, 'остаток от деления')
# print(x, 'деление нацело')
# print(v, 'возведение в степень')

# a = int(input("целое число"))
# b = int(input("целое число"))
# c = input()
# d = float(input("дробное число"))
# v = a + b + d
# print(a)
# print(b)
# print(c)
# print(d)
# print(v)
# a = int(input("Введите целое число"))
# pi = float(input("введите дробное число"))
# t = bool(input("введите значение True | False"))
# print(a)
# print(pi)
# print(t)
# a = 8
# b = 2.5
# c = True
# d = 'Hello'
# a = str(a)
# b = str(b)
# print(a)
# print(b)
# print(c)
# print(d)
# print(a + b)
# a = input('Имя')
# b = input('Фамилия')
# c = input('Отчество')
# d = int(input('возраст'))
# e = input('Город проживания')
# print(b, a, c)
# print(d)
# print(e)
# a = int(input('первое число'))
# b = int(input('второе число'))
# c = int(input('третье число'))
# print('сумма', a + b, 'разность', a - b, 'произведение', a * b, 'деление', a / b, 'возведение в степень', a ** b)
# print('сумма', a + c, 'разность', a - c, 'произведение', a * c, 'деление', a / c, 'возведение в степень', a ** c)
# print('сумма', b + c, 'разность', b - c, 'произведение', b * c, 'деление', b / c, 'возведение в степень', b ** c)
# print('разность', b - a, 'деление', b / a, 'возведение в степень', b ** a)
# print('разность', c - a, 'деление', c / a, 'возведение в степень', c ** a)
# print('разность', c - b, 'деление', c / b, 'возведение в степень', c ** b)
#
# print('сумма', a + b + c, 'разность', a - b - c, 'произведение', a * b * c, 'деление', a / b / c)
# print('разность', b - a - c, 'деление', b / a / c)
# print('разность', c - a - b, 'деление', c / a / b)
# import random #импортируем рандом
# a = random.randint(100, 999)
# print(a)
# b = a // 100 #извлекаем первую цифру(старший разряд) делением нацело на 100
# c = (a // 10) % 10 #делением нацело на 10 удаляем последнюю цифру числа. затем находим остаток при делении на 10 (%)
# # извлекаем вторую цифру
# d = a % 10 # последнюю цифру находим путем нахождения остатка при делении нацело на 10
# print(b + c + d)
